# Pandas remaining

## Missing values

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d={'A':[1,2,np.nan],'B':[np.nan,7,np.nan],'C':[1,2,9]}

In [4]:
df = pd.DataFrame(d) #dictionary into dataframe

In [5]:
df

     A    B  C
0  1.0  NaN  1
1  2.0  7.0  2
2  NaN  NaN  9

In [6]:
df.dropna()  #dropping all nan rows

     A    B  C
1  2.0  7.0  2

In [7]:
df

     A    B  C
0  1.0  NaN  1
1  2.0  7.0  2
2  NaN  NaN  9

In [8]:
df.fillna(value=33) #filling in all nan

      A     B  C
0   1.0  33.0  1
1   2.0   7.0  2
2  33.0  33.0  9

In [9]:
df['B'].fillna(value=df['B'].mean(),inplace=True) # filling in a column

In [10]:
df

     A    B  C
0  1.0  7.0  1
1  2.0  7.0  2
2  NaN  7.0  9

## Pandas Groupby

In [11]:
import numpy as np

In [12]:
import pandas as pd

In [13]:
d={'Company':['CWG','EWEF','ERWA','CWG','EWEF','ERWA'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
   'Sales':[200,848,111,787,199,542]}

In [14]:
df =pd.DataFrame(d)

In [15]:
df

  Company   Person  Sales
0     CWG      Sam    200
1    EWEF  Charlie    848
2    ERWA      Amy    111
3     CWG  Vanessa    787
4    EWEF     Carl    199
5    ERWA    Sarah    542

In [16]:
cf=df.groupby('Company')

In [17]:
cf

In [18]:
cf.sum()

         Sales
Company
CWG        987
ERWA       653
EWEF      1047

In [19]:
cf.mean()

         Sales
Company
CWG      493.5
ERWA     326.5
EWEF     523.5

In [20]:
cf.std()

              Sales
Company
CWG      415.071681
ERWA     304.763023
EWEF     458.912301

In [21]:
df.groupby('Company').mean().loc['CWG']  # mostly used inliner

Sales    493.5
Name: CWG, dtype: float64

## Merging , joining and concatenating

## Operations

In [22]:
import numpy as np

In [23]:
import pandas as pd

In [24]:
df = pd.DataFrame({'col1' : [1,2,3,4],
                  'col2' : [444,555,666,444],
                  'col3' : ['abc','def','gef','hij']})

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  gef
3     4   444  hij

In [26]:
# finding unique values in a column
df['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [27]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [28]:
# number of unique value in the numpy array we get

In [29]:
df['col2'].nunique()

3

In [30]:
# or
len(df['col2'].unique())

3

In [31]:
#Frequency of a unique value

In [32]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [33]:
# conditional selection

In [34]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  gef
3     4   444  hij

In [35]:
df[(df['col1']>1) & (df['col2']>111)]

   col1  col2 col3
1     2   555  def
2     3   666  gef
3     4   444  hij

In [36]:
# function
def times2(x):
    return x*2;

In [37]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  gefgef
3     8   888  hijhij

In [38]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [39]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [40]:
# Removing columns

In [41]:
df.drop('col1',axis = 1) #temprory

   col2 col3
0   444  abc
1   555  def
2   666  gef
3   444  hij

In [42]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  gef
3     4   444  hij

In [43]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [44]:
df.sort_values('col2') # sorting by values , ans is a df where on basis of values whole rows gets sorted

   col1  col2 col3
0     1   444  abc
3     4   444  hij
1     2   555  def
2     3   666  gef

In [45]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Data input and output

In [46]:
import numpy as np

In [47]:
import pandas as pd

In [48]:
pwd #location of jupyter notebook

'd:\\applications\\Jupyter files'

In [49]:
# html
df1 = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [50]:
type(df1)

list

In [51]:
df1[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [52]:
df1

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [53]:
df1[0].to_html('new_html1')

In [54]:
type(pd.read_html('new_html1'))

list

In [55]:
# Excel

In [57]:
df2= pd.read_excel('fileExcel.xlxs', sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument 'sheetname'